%%%-------------------------------------------------------------------
%%% @author tihon
%%% @copyright (C) 2014, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 23. мар 2014 21:50
%%%-------------------------------------------------------------------
-module(ss_main_packet).
-author("tihon").

%% API
-export([get_type_by_packet/1, get_packet_by_type/1]).

%%--------------------------------------------------------------------
%% @private
%% @doc
%% Получает атом тип пакета из целочисленного значения
%%
%% @end
%%--------------------------------------------------------------------
get_type_by_packet(1) -> guest_auth_packet;
get_type_by_packet(2) -> login_auth_packet.

%%--------------------------------------------------------------------
%% @private
%% @doc
%% Получает целочисленное значение пакета из атома типа
%%
%% @end
%%--------------------------------------------------------------------
get_packet_by_type(guest_auth_packet) -> 1;
get_packet_by_type(login_auth_packet) -> 2;
get_packet_by_type(auth_resp_packet) -> 3.

